
$(document).ready(function(){
    /*
    *新闻切换 
    */
   $(".news-tabs .company").on("click", function(){
        $(".news-tabs .company").css("color","#2b2117");
       $(".news-tabs .industry").css("color","#b3b6b7");
       $(".news-tabs .line").css("left","0");
       $(".news-tabs .tabs-news").css("display","block");
       $(".news-tabs .tabs-industry").css("display","none");
   })
   $(".news-tabs .industry").on("click", function(){
        $(".news-tabs .company").css("color","#b3b6b7");    
        $(".news-tabs .industry").css("color","#2b2117");
        $(".news-tabs .line").css("left","180px");
        $(".news-tabs .tabs-news").css("display","none");
        $(".news-tabs .tabs-industry").css("display","block");
    })
    $(window).scroll(function(){
        var scrolltop = $(document).scrollTop();
        if(scrolltop>10 && scrolltop <1080){
           $(".header-container").css({"box-shadow":'none',"background-color":"rgba(43,33,23,0.1)"}) 
        }else if(scrolltop >=1080){
            $(".header-container").css({"box-shadow":'none',"background-color": "rgba(43,33,23,1)"}) 
        }else{
            $(".header-container").css({"box-shadow":'inset 0px -1px 0px 0px #af9064',"background-color": "none"}) 
        }
    })
    function initTable(data){
        $('.recruitment-table').bootstrapTable({
            columns: [ {
                field: 'a',
                width:400,
            }, {
                field: 'b',
                width:400
            },{
                field:'c',
                width:400,
                align:'center'
            },{
                field:'d',
                width:400,
                align:'center'
            }],
            data: data,
            pagination:true,
            pageNumber:1,
            showHeader:false,
            // onlyInfoPagination:false, 
            pageSize:5,
            // showJumpto：true
        });   
    }
    //news-table
    //
    function initFormatter(value, row, index){
        var initArray = [];
        for(var i = 0; i<value.length; i+=1){
            var item = '<div class="news-item"><div class="content">'+'不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新'+'</div><div class="date">' +'2019/1/6'+ '</div></div>';
            initArray.push(item);
        }
        var results =  initArray.join(" ");
        console.log("value",  results);
        return results;
    }
    function initdateFornatter(value, row, index){
        console.log("value", value);
        var result =  '<div class="news-month-title" style="height:' + value.length*54 +'px"><div class="content"><span class="year">2018</span><i class="line"></i> <span class="month">1月</span></div></div>'
        return result;
    }
    function initNewsTable(data){
        $('.news-table').bootstrapTable({
            columns: [ {
                field: 'b',
                formatter:initdateFornatter
            }, {
                field: 'b',
                formatter:initFormatter
            }],
            data: data,
            pagination:true,
            pageNumber:1,
            showHeader:false,
            // onlyInfoPagination:false, 
            pageSize:2,
            // showJumpto：true
        });  
        $(".news-tabs .pull-right").css("display","inline-block");
    }
    var formData = [{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},
    {'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},{'a':'人事专员','b':'1年经验 | 大专','c':'嘉兴','d':'4-6k'},]
    initTable(formData);
    var newsData = [
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'一月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
        {'a':'二月','b':["不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新","不断增强中国科技创新硬实力——“改革先锋”中科技人物谈创新"]},
    ]
    initNewsTable(newsData); 
    var map = new BMap.Map("map-container");
    var myGeo = new BMap.Geocoder();
    myGeo.getPoint("四川省成都市金牛区人民北路二段金牛万达甲级写字楼A座2802", function(point){
		if (point) {
            map.centerAndZoom(point, 16);
            var marker = new BMap.Marker(point);
            map.addOverlay(marker);
            marker.setAnimation(BMAP_ANIMATION_BOUNCE);
		}else{
			alert("您选择地址没有解析到结果!");
		}
    });
})